
## Plan Result (github)

[CI link](https://github.com/nasa9084/infrastructure/actions/runs/13373032820)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository.exporter_web_apps_tech


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_repository.exporter_web_apps_tech will be created
  + resource "github_repository" "exporter_web_apps_tech" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "exporter.web-apps.tech"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + pages {
          + build_type = "workflow"
          + cname      = "exporter.web-apps.tech"
          + custom_404 = (known after apply)
          + html_url   = (known after apply)
          + status     = (known after apply)
          + url        = (known after apply)

          + source {
              + branch = "gh-pages"
              + path   = "/"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":64,"Program":"tfcmt","SHA1":"9050995f7b56c73b15dd4ea68a7371c511c89115","Target":"github","Vars":{},"WorkflowName":"Terraform Plan"} -->